** Sintaxe

#+BEGIN_SRC red :exports both :results output
  help parse
#+END_SRC

#+RESULTS:
#+begin_example

USAGE:
      parse input rules /case /part length /trace callback
ARGUMENTS:
     input   [binary! any-block! any-string!] 
     rules   [block!] 

REFINEMENTS:
     /case 
     /part 
         length   [number! series!] 
     /trace 
         callback   [function! [
    event [word!] 
    match? [logic!] 
    rule [block!] 
    input [series!] 
    stack [block!] 
    return: [logic!]
]] 

#+end_example

